app/controllers/myposts_controller.rb

SELECT * FROM "myposts"
---
  def index
    @myposts = Mypost.all

SELECT * FROM "myposts" WHERE ("myposts"."id" = 1)
---
  def show
    @mypost = Mypost.find(params[:id])

INSERT INTO "myposts" ("title", "updated_at", "post_date", "comment", "created_at") VALUES('my 1st post', '2015-01-07 19:04:26', '2015-01-07 19:04:00', 'just got it work!', '2015-01-07 19:04:26')
---
  def create
    @mypost = Mypost.new(params[:mypost])

    respond_to do |format|
      if @mypost.save

SELECT * FROM "myposts" WHERE ("myposts"."id" = 2)
DELETE FROM "myposts" WHERE "id" = 2
---
  def destroy
    @mypost = Mypost.find(params[:id])
    @mypost.destroy